import React from "react";

export default function GymnasioParts() {
  return (
    <>
      <div>
        Τα παιδιά παίζοντας, μαθαίνουν να κατασκευάζουν απλές μηχανές,
        κατανοώντας έτσι βασικές αρχές λειτουργίας τους. Οι μαθητές κατ’ αυτόν
        τον τρόπο έρχονται σε πρώτη επαφή με τους νόμους της φυσικής. Ο στόχος
        του εκπαιδευτικού προγράμματος είναι, μέσω της μεταξύ τους συνεργασίας ,
        συναρμολογώντας τροχαλίες, γρανάζια, άξονες κ.τ.λ. , να δώσουν λύση σε
        ένα πρόβλημα. Οι δραστηριότητες συνοδεύονται από ειδικά διαμορφωμένα
        φύλλα εργασίας που επιτρέπουν στο παιδί με απλό τρόπο να επαληθεύει αυτά
        που έμαθε.
      </div>
      <div className="pt-4">
        Το πρόγραμμα εκπαιδευτικής ρομποτικής <strong>LEGO WeDo2</strong>
        &nbsp; αφορά παιδιά ηλικίας από πρώτη δημοτικού μέχρι και τρίτη
        δημοτικού και ήρθε να αναβαθμίσει τον τρόπο που διδάσκονταν η ρομποτική
        στα παιδιά. Προσφέροντας ολοκαίνουργιο εκπαιδευτικό υλικό και νέες
        δραστηριότητες, δίνει ερεθίσματα στα παιδιά να ανακαλύψουν τους νόμους
        της μηχανικής, εξερευνώντας και παρατηρώντας τους μηχανισμούς που
        κατασκευάζουν οι ίδιοι βήμα-βήμα. ‘Έτσι επιτυγχάνεται η εισαγωγή των
        μαθητών του δημοτικού σχολείου στην εκπαιδευτική ρομποτική. Το βασικό
        πακέτο με το λογισμικό και η Εισαγωγική Δραστηριότητα είναι σχεδιασμένο
        για τις τάξεις του Δημοτικού, παρέχοντας μια εκπαιδευτική λύση που θα
        εξάψει την περιέργεια των μαθητών, ενώ παράλληλα θα βελτιώσει τις
        ικανότητες τους στα πεδία των φυσικών επιστημών, της μηχανικής, της
        τεχνολογίας και του προγραμματισμού. Τα παιδιά του Δημοτικού
        κατασκευάζουν με δομικά στοιχεία (τουβλάκια) μηχανικές κατασκευές που
        μπορούν να αποτελέσουν τους ήρωες της δικής τους φανταστικής περιπέτειας
        και να συνδυάσουν προβλήματα από το φυσικό κόσμο που τα περιβάλλει. Η
        σύνδεση με τον υπολογιστή ή το tablet είναι πλέον ασύρματη, γεγονός που
        δίνει απεριόριστες δυνατότητες στην κίνηση και τη δομή της κατασκευής
        και απελευθερώνει τη φαντασία και τη δημιουργικότητα των παιδιών.
      </div>
    </>
  );
}
