import React, { useState } from "react";
import ImageCard from "../../ImageCard";

export default function GymnasioParts() {
  const [infoTab, setInfoTab] = useState(1);

  function activeTab(current) {
    if (infoTab === current) {
      return "border-blue-400";
    }
    return "border-transparent";
  }

  return (
    <>
      <nav className="bg-white px-8 shadow-md">
        <div className="-mb-px flex justify-center">
          <button
            className={`no-underline text-grey-200 border-b-2 focus:outline-none tracking-wide font-bold text-xs py-3 mr-8 ${activeTab(
              1
            )}`}
            onClick={() => setInfoTab(1)}
          >
            1o Μέρος
          </button>
          <button
            className={`no-underline text-grey-200 focus:outline-none border-b-2 tracking-wide font-bold text-xs py-3 mr-8 ${activeTab(
              2
            )}`}
            onClick={() => setInfoTab(2)}
          >
            2ο Μέρος
          </button>
        </div>
      </nav>
      <div className="pt-12">
        {infoTab === 1 ? <CustomParts part={1} /> : <CustomParts part={2} />}
      </div>
    </>
  );
}

function CustomParts({ part }) {
  if (part === 1) {
    return (
      <>
        <h1 className="block pb-2 text-xl font-bold text-center">
          Πρώτο Μέρος - Εισαγωγή στην Ρομποτική - Σκυταλοδρομία
        </h1>

        <div className="pt-2">
          <span className="font-bold">Γενικά στοιχεία: </span>Η συνεδρία μας
          είναι χωρισμένη σε τρεις ενότητες. Η πρώτη ενότητα έχει ως στόχο να
          γνωρίσουν τα παιδιά τι είναι η ρομποτική και τα προετοιμάζει σε
          θεωρητικό επίπεδο, για τις δραστηριότητες που θα ακολουθήσουν. Η
          δεύτερη ενότητα είναι και η πιο σημαντική. Τα παιδιά θα δημιουργήσουν
          τα δικά τους ρομπότ προγραμματίζοντας τα. Η τρίτη ενότητα είναι η πιο
          ενδιαφέρουσα για τα παιδιά. Αφού ολοκληρώσουν τις κατασκευές τους
          έρχεται η ώρα για παιχνίδι. Στα πλαίσια αυτής της ενότητας η κάθε
          ομάδα πρέπει να μας παρουσιάσει την κατασκευή τους.
        </div>

        <div className="pt-2">
          <span className="font-bold">Θεματική Ενότητα: </span>
          Όπως και τα μαθήματα, έτσι και αυτή η μεμονωμένη δραστηριότητα είναι
          βασισμένη πάνω σε μία θεματολογία. Στην προτεινόμενη δραστηριότητα η
          θεματική ενότητα είναι οι Ολυμπιακοί Αγώνες στην αρχαιότητα.
          <div className="p-8 flex items-center justify-center">
            <ImageCard
              image="/img/skytalodromia.jpg"
              description="Σκυταλοδρομία στην αρχαιότητα"
            />
          </div>
        </div>

        <div className="pt-2">
          <span className="block font-bold text-blue-700">1η Ενότητα: </span>
          Κατά την προέλευση τους τα παιδιά συγκεντρώνονται στην αμφιθεατρική
          αίθουσα. Η αίθουσα είναι χωρητικότητας 60 ατόμων. Διαθέτει
          videoprojector και ηλεκτρονικό υπολογιστή. Ακόμη υπάρχει ρομποτική
          πίστα επιδείξεων για την πρώτη γνωριμία των παιδιών με την ρομποτική.
          Στόχοι της πρώτης αυτής ενότητας είναι να μάθουν τα παιδιά βασικά
          πράγματα για την ρομποτική μέσα από τη σχετική παρουσίαση που θα
          ακολουθήσει. Υπάρχουν έννοιες που τις ακούμε και χρησιμοποιούμε
          καθημερινά, αλλά όχι πάντα με τον σωστό τρόπο. Τελειώνοντας αυτή την
          ενότητα τα παιδιά θα ξέρουν να απαντούν σε ερωτήματα όπως:
          <ol className="list-decimal list-inside font-semibold">
            <li className="pl-4">Τι είναι ρομπότ;</li>
            <li className="pl-4">
              Ποια η διαφορά ενός ρομπότ και μίας μηχανής;
            </li>
            <li className="pl-4">Ποια είναι τα βασικά μέρη ενός ρομπότ;</li>
            <li className="pl-4">Πως δουλεύουν τα ρομπότ;</li>
          </ol>
          Οι παραπάνω ερωτήσεις είναι κάποιες από τα θέματα τα οποία θα
          προσεγγίσουμε σε αυτή την πρώτη ενότητα. Αφού ολοκληρώσουμε τα
          θεωρητικά και αποσαφηνίσουμε τι είναι τελικά ρομπότ, θα γνωρίσουμε το
          εκπαιδευτικό πακέτο με το οποίο θα ασχοληθούμε κατά τη διάρκεια των
          δύο επόμενων ενοτήτων. Το εκπαιδευτικό πακέτο που χρησιμοποιούμε είναι
          το LEGO Mindstorms EV3. <br />
          Αφού ολοκληρώσουμε αυτό το κομμάτι ξεκινάμε μια συζήτηση για το στόχο
          μας. Στόχος μας είναι να κατασκευάσουμε ένα ρομπότ-αθλητή προκειμένου
          να κατέβει στους Ολυμπιακούς αγώνες στο άθλημα της πάλης. Συζητάμε και
          μαθαίνουμε πράγματα για τους Ολυμπιακούς αγώνες: Πότε και από που
          ξεκίνησαν, ποια αθλήματα υπήρχαν στην αρχαιότητα και ποια υπάρχουν
          σήμερα, κ.α. και τα παιδιά λαμβάνουν απαραίτητες οδηγίες και κανόνες
          για τον αγώνα που θα διεξαχθεί στο τέλος. Στο τέλος της παρουσίασης
          παρακολουθούν ένα βίντεο με την κατασκευή που θα ακολουθήσει ώστε να
          έχουν μια πρώτη ιδέα. <br />Η πρώτη ενότητα τελειώνει και τα παιδιά
          κάνουν διάλειμμα .Μετά από το διάλειμμα οδηγούνται στις αίθουσες για
          να κατασκευάσουν τα ρομπότ
        </div>

        <div className="pt-2">
          <span className="block font-bold text-blue-700">2η Ενότητα: </span>
          <div>
            Χωρίζονται σε ομάδες των 2-3 ατόμων. Κάθε ομάδα παρακολουθεί τις
            σχετικές οδηγίες που υπάρχουν σε κάθε υπολογιστή και ξεκινάει να τις
            εκτελεί. Μετά το πέρας της 2ης ενότητας οι ομάδες θα έχουν από ένα
            ρομπότ-αθλητή έτοιμο που θα το προγραμματίσουν ώστε να αγωνιστεί.
          </div>
          <div>
            Τα παιδιά που έχουν παραμείνει στο αμφιθέατρο παρακολουθούν βίντεο
            από την Ολυμπιάδα Ρομποτικής και κατασκευές ρομπότ με Lego, μέχρι να
            έρθει η σειρά τους να περάσουν στις αίθουσες.
          </div>
        </div>

        <div className="pt-2">
          <span className="block font-bold text-blue-700">3η Ενότητα: </span>
          <div>
            Ο αγώνας ξεκινά! Ο διαιτητής κρατάει το σκορ. Θα δοθούν δύο
            ευκαιρίες για τροποποιήσεις. Ο καλύτερος ας νικήσει!
          </div>
        </div>
      </>
    );
  }

  return (
    <>
      <h1 className="block pb-2 text-xl font-bold text-center">
        Δεύτερο Μέρος - Εισαγωγή στην Ρομποτική - Καταπέλτης
      </h1>

      <div className="pt-2">
        <span className="font-bold">Γενικά στοιχεία: </span>Η συνεδρία μας είναι
        χωρισμένη σε τρεις ενότητες. Η πρώτη ενότητα έχει ως στόχο να γνωρίσουν
        τα παιδιά τι είναι η ρομποτική και τα προετοιμάζει σε θεωρητικό επίπεδο,
        για τις δραστηριότητες που θα ακολουθήσουν. Η δεύτερη ενότητα είναι και
        η πιο σημαντική. Τα παιδιά θα δημιουργήσουν τα δικά τους ρομπότ
        προγραμματίζοντας τα. Η τρίτη ενότητα είναι η πιο ενδιαφέρουσα για τα
        παιδιά. Αφού ολοκληρώσουν τις κατασκευές τους έρχεται η ώρα για
        παιχνίδι. Στα πλαίσια αυτής της ενότητας η κάθε ομάδα πρέπει να μας
        παρουσιάσει την κατασκευή τους.
      </div>

      <div className="pt-2">
        <span className="font-bold">Θεματική Ενότητα: </span>
        Όπως και τα μαθήματα, έτσι και αυτή η μεμονωμένη δραστηριότητα είναι
        βασισμένη πάνω σε μία θεματολογία. Στην προτεινόμενη δραστηριότητα η
        θεματική ενότητα είναι ο καταπέλτης, η περίφημη αρχαία πολεμική μηχανή.
        <div className="p-8 flex items-center justify-center">
          <ImageCard
            image="/img/katapeltis.jpg"
            description="Καταπέλτης"
          />
        </div>
      </div>

      <div className="pt-2">
        <span className="block font-bold text-blue-700">1η Ενότητα: </span>
        Κατά την προέλευση τους τα παιδιά συγκεντρώνονται στην αμφιθεατρική
        αίθουσα. Η αίθουσα είναι χωρητικότητας 60 ατόμων. Διαθέτει video
        projector και ηλεκτρονικό υπολογιστή. Ακόμη υπάρχει ρομποτική πίστα
        επιδείξεων για την πρώτη γνωριμία των παιδιών με την ρομποτική. Στόχοι
        της πρώτης αυτής ενότητας είναι να μάθουν τα παιδιά βασικά πράγματα για
        την ρομποτική μέσα από τη σχετική παρουσίαση που θα ακολουθήσει.
        Υπάρχουν έννοιες που τις ακούμε και χρησιμοποιούμε καθημερινά, αλλά όχι
        πάντα με τον σωστό τρόπο. Τελειώνοντας αυτή την ενότητα τα παιδιά θα
        ξέρουν να απαντούν σε ερωτήματα όπως:
        <ol className="list-decimal list-inside font-semibold">
          <li className="pl-4">Τι είναι ρομπότ;</li>
          <li className="pl-4">Ποια η διαφορά ενός ρομπότ και μίας μηχανής;</li>
          <li className="pl-4">Ποια είναι τα βασικά μέρη ενός ρομπότ;</li>
          <li className="pl-4">Πως δουλεύουν τα ρομπότ;</li>
        </ol>
        Οι παραπάνω ερωτήσεις είναι κάποιες από τα θέματα τα οποία θα
        προσεγγίσουμε σε αυτή την πρώτη ενότητα. Αφού ολοκληρώσουμε τα θεωρητικά
        και αποσαφηνίσουμε τι είναι τελικά ρομπότ, θα γνωρίσουμε το εκπαιδευτικό
        πακέτο με το οποίο θα ασχοληθούμε κατά τη διάρκεια των δύο επόμενων
        ενοτήτων. Το εκπαιδευτικό πακέτο που χρησιμοποιούμε είναι το LEGO
        Mindstorms EV3. <br />
        Αφού ολοκληρώσουμε αυτό το κομμάτι ξεκινάμε μια συζήτηση για το στόχο
        μας. Στόχος μας είναι να κατασκευάσουμε ένα ρομπότ-αθλητή προκειμένου να
        κατέβει στους Ολυμπιακούς αγώνες στο άθλημα της πάλης. Συζητάμε και
        μαθαίνουμε πράγματα για τους Ολυμπιακούς αγώνες: Πότε και από που
        ξεκίνησαν, ποια αθλήματα υπήρχαν στην αρχαιότητα και ποια υπάρχουν
        σήμερα, κ.α. και τα παιδιά λαμβάνουν απαραίτητες οδηγίες και κανόνες για
        τον αγώνα που θα διεξαχθεί στο τέλος. Στο τέλος της παρουσίασης
        παρακολουθούν ένα βίντεο με την κατασκευή που θα ακολουθήσει ώστε να
        έχουν μια πρώτη ιδέα. Η πρώτη ενότητα τελειώνει και τα παιδιά κάνουν
        διάλειμμα .Μετά από το διάλειμμα οδηγούνται στις αίθουσες για να
        κατασκευάσουν τα ρομπότ
      </div>

      <div className="pt-2">
        <span className="block font-bold text-blue-700">2η Ενότητα: </span>
        <div>
          Χωρίζονται σε ομάδες των 2-3 ατόμων. Κάθε ομάδα παρακολουθεί τις
          σχετικές οδηγίες που υπάρχουν σε κάθε υπολογιστή και ξεκινάει να τις
          εκτελεί. Μετά το πέρας της 2ης ενότητας οι ομάδες θα έχουν από ένα
          ρομπότ-αθλητή έτοιμο που θα το προγραμματίσουν ώστε να αγωνιστεί.
        </div>
        <div>
          Τα παιδιά που έχουν παραμείνει στο αμφιθέατρο παρακολουθούν βίντεο από
          την Ολυμπιάδα Ρομποτικής και κατασκευές ρομπότ με Lego, μέχρι να έρθει
          η σειρά τους να περάσουν στις αίθουσες.
        </div>
      </div>

      <div className="pt-2">
        <span className="block font-bold text-blue-700">3η Ενότητα: </span>
        <div>Ο αγώνας ξεκινά! Ο καλύτερος ας νικήσει!</div>
      </div>
    </>
  );
}
