import React from "react";

export default function LyceioParts() {
  return (
    <div>
      Ο όρος <strong>"εκπαιδευτική ρομποτική"</strong> αναφέρεται στη διδακτική
      πρακτική κατά την οποία ο εκπαιδευτικός χρησιμοποιώντας τα ρομπότ
      προσεγγίζει τη γνώση άλλοτε μέσα από τα ρομπότ και άλλοτε για τα ίδια τα
      ρομπότ. Μια ειδική κατηγορία εκπαιδευτικής ρομποτικής συνιστούν τα
      προγραμματιζόμενα παιχνίδια τύπου Logo τα οποία βρίσκουν ιδιαίτερη
      εφαρμογή στην προσχολική και στην πρώτη σχολική ηλικία .Τα παιδιά
      σχεδιάζουν και καθορίζουν το σύνολο των εντολών που εισάγονται στα ρομπότ
      κατά περίσταση , ακολουθώντας τις αρχές της γλώσσας προγραμματισμού Logo
      που ευνοεί την ανάπτυξη μεταγνωστικής ικανότητας , και την οποία τα παιδιά
      αναστοχάζονται σχετικά με τις διαδικασίες σκέψης που έχουν ακολουθήσει ,
      βελτιώνει την ικανότητα χωρικού προσανατολισμού . Ένα από τα πιο
      διαδεδομένα προγραμματιζόμενα παιχνίδια είναι το Bee-Boot, το οποίο
      ενσαρκώνει τη μέλισσα Logo και βασίζεται σε αρχές προγραμματισμού της
      γλώσσας αυτής για τον έλεγχο του ρομπότ δαπέδου .Τα παιδιά μπορούν έτσι να
      προγραμματίσουν μια διαδρομή πάνω σε ένα δάπεδο .Το ρομπότ έχει το σχήμα
      και τα χρώματα της μέλισσας .Ο προγραμματισμός των κινήσεων βρίσκεται στο
      πάνω μέλος του ρομπότ και στηρίζεται σε ένα σύνολο χρωματικών πλήκτρων.
      Τέσσερα πορτοκαλί πλήκτρα εξυπηρετούν την εμπρόσθια και οπίσθια κίνηση και
      την περιστροφή αριστερά/δεξιά. Το κεντρικό πλήκτρο (GO) χρησιμοποιείται
      για την εκτέλεση των εντολών του παιχνιδιού .Τα δύο μπλε πλήκτρα
      εξυπηρετούν διαφορετικές λειτουργίες .Το ένα ( CLEAR ) χρησιμεύει για την
      διαγραφή των εντολών από τη μνήμη .Το δεύτερο ( PAUSE ) παρέχει τη
      δυνατότητα στο χρήστη να διακόπτει στιγμιαία την εκτέλεση των εντολών.
    </div>
  );
}
