import React from "react";

export default function NipiaParts() {
  return (
    <>
      <h1 className="block pb-2 text-xl font-bold text-center">
        Επαφή με τη ρομποτική - Καθοδηγώντας τη μέλισσα
      </h1>

      <div className="pt-2">
        <span className="font-bold">Γενικά στοιχεία: </span>Η συνεδρία μας είναι
        χωρισμένη σε δύο ενότητες. Η πρώτη ενότητα έχει ως στόχο να γνωρίσουν τα
        παιδιά τι είναι η ρομποτική και τα προετοιμάζει σε θεωρητικό επίπεδο. Η
        δεύτερη ενότητα είναι και η πιο σημαντική. Τα παιδιά θα κινήσουν τα
        ρομπότ προγραμματίζοντας τα με απλές κινήσεις.
      </div>

      <div className="pt-2">
        <span className="font-bold">Θεματική Ενότητα: </span>
        Όπως και τα μαθήματα, έτσι και αυτές οι δραστηριότητες είναι βασισμένες
        πάνω σε μία θεματολογία. Στις δραστηριότητες που θα πραγματοποιηθούν οι
        θεματικές ενότητες είναι τα χρώματα, τα σχήματα, τα ζώα, τα τρόφιμα,
        λαβύρινθοι και παραμύθια.
      </div>

      <div className="pt-2">
        <span className="font-bold text-blue-700">1η Ενότητα: </span>
        Κατά την προέλευση τους τα παιδιά συγκεντρώνονται στην αμφιθεατρική
        αίθουσα. Η αίθουσα είναι χωρητικότητας 60 ατόμων. Διαθέτει
        videoprojector και ηλεκτρονικό υπολογιστή. Ακόμη υπάρχει ρομποτική πίστα
        επιδείξεων για την πρώτη γνωριμία των παιδιών με την ρομποτική. Στόχοι
        της πρώτης αυτής ενότητας είναι να μάθουν τα παιδιά βασικά πράγματα για
        την ρομποτική μέσα από τη σχετική παρουσίαση που θα ακολουθήσει.
        Υπάρχουν έννοιες που τις ακούμε και χρησιμοποιούμε καθημερινά, αλλά όχι
        πάντα με τον σωστό τρόπο. Τελειώνοντας αυτή την ενότητα τα παιδιά θα
        ξέρουν να απαντούν σε ερωτήματα όπως:
        <ol className="list-decimal list-inside font-semibold">
          <li className="pl-4">Τι είναι ρομπότ;</li>
          <li className="pl-4">Ποια η διαφορά ενός ρομπότ και μίας μηχανής;</li>
          <li className="pl-4">Ποια είναι τα βασικά μέρη ενός ρομπότ;</li>
          <li className="pl-4">Πως δουλεύουν τα ρομπότ;</li>
        </ol>
        Αφού ολοκληρώσουμε τα θεωρητικά και αποσαφηνίσουμε τι είναι τελικά
        ρομπότ, θα γνωρίσουμε το εκπαιδευτικό πακέτο με το οποίο θα ασχοληθούμε
        κατά τη διάρκεια των επόμενων δραστηριοτήτων. Το εκπαιδευτικό πακέτο που
        χρησιμοποιούμε είναι το η ρομποτική μέλισσα BeeBot. Η πρώτη ενότητα
        τελειώνει και τα παιδιά κάνουν διάλειμμα .Μετά από το διάλειμμα
        οδηγούνται στις αίθουσες για να καθοδηγήσουν τα ρομπότ.
      </div>

      <div className="pt-2">
        <span className="font-bold text-blue-700">2η Ενότητα: </span>
        <div>
          Χωρίζονται σε ομάδες των 10 ατόμων στις 2 αίθουσες. Κάθε ομάδα
          παρακολουθεί τις σχετικές οδηγίες που θα δοθούν από το δάσκαλο για τη
          λειτουργία της ρομποτικής μέλισσας και ξεκινάει να τις εκτελεί πάνω
          στις διάφορες πίστες με θέματα που αναφέρθηκαν νωρίτερα.
        </div>
        <div>
          Τα παιδιά που έχουν παραμείνει στο αμφιθέατρο παρακολουθούν βίντεο από
          την Ολυμπιάδα Ρομποτικής και κατασκευές ρομπότ με Lego, μέχρι να έρθει
          η σειρά τους να περάσουν στις αίθουσες.
        </div>
      </div>
    </>
  );
}
