export const items = [
  {
    title: "Προσφορά εκτυπωτή στο 424 Στρατιωτικό Νοσοκομείο",
    content:
      "Στα πλαίσια της Κοινωνικής μας Υπευθυνότητας προσφέραμε στο 424 Στρατιωτικό Νοσοκομείο Θεσσαλονίκης και πιο συγκεκριμένα στην Νευρολογική Κλινική, έναν εκτυπωτή Samsung Express M2026 για να ενισχύσουμε το έργο του νοσοκομείου.",
  },
  {
    title:
      "Στηρίζουμε παίζοντας σε συνεργασία με την Αρωγή Θεσσαλονίκης - Κοινωνική Δράση",
    content:
      "Πήραμε μέρος στην εκδήλωση “Στηρίζουμε…Παίζοντας” σε συνεργασία με την Αρωγή Θεσσαλονίκης, όπου παρουσιάστηκε η Εκπαιδευτική Ρομποτική ROBOT SET GO robotics & more μέσα από τα δικά μας μάτια. Συνδιάζοντας την μάθηση με το παιχνίδι δημιουργήθηκε ένα ευχάριστο κλίμα, καθώς συνεισφέραμε στην κοινωνική δράση της Αρωγής.",
  },
  {
    title: "Κοινωνική δράση στο Ενοριακό Πνευματικό Κέντρο της Καρδίας",
    content: "Παρουσίαση Εκπαιδευτικής Ρομποτικής",
  },
  {
    title: "Active KIDS event – Δραστηριότητες για παιδιά",
    content:
      "Την Κυριακή στις 7 Απριλίου στον πολυχώρο WE και σε συνεργασία με την κοινωνική συνεταιριστική εταιρεία Stay Strong Event, θα διεξαχθεί μια εκδήλωση που θα παρουσιαστεί η ρομποτική για τους μικρούς μας φίλους. Μέσα από παιχνίδια που σχετίζονται με το αντικείμενο μας, θα κρατηθεί ζωντανό το ενδιαφέρον των παιδιών. Αφού γνωρίσουν τι είναι η ρομποτική μέσα από τις απαραίτητες οδηγίες, θα μπούν στην διαδικασία κατασκευής και προγραμματισμού ρομπότ στην πράξη. Μέρος των εσόδων του event θα διατεθούν για την ενίσχυση του οργανισμού ‘Make A Wish’ (Κάνε-Μια-Ευχή Ελλάδος).",
  },
  {
    title: "Προσφορά δώρων στο αρχιγένειο Δημοτικό Σχολείο Νέων Επιβατών",
    content: "",
  },
  {
    title: "Δωρεά Ηλεκτρονικού Υπολογιστή στο 1ο Γυμνάσιο Μίκρας",
    content: "",
  },
  {
    title:
      "Χριστουγεννιάτικο Bazaar | 2018 του 2ου Δημοτικού Σχολείου Τριλόφου",
    content:
      "Συμμετείχαμε στο Χριστουγεννιάτικο Bazzar που διοργάνωσε ο Σύλλογος Γονέων & Κηδεμόνων 2ου Δημοτικού Σχολείου Τριλόφου.",
  },
  {
    title:
      "Συμμετέχουμε στη φιλανθρωπική εκδήλωση “Γίνε Ήρωας μαζί μου για τη Λάμψη”",
    content:
      "Σάββατο 10 Νοεμβρίου, από τις 10 το πρωί μέχρι και λίγο πριν τις 8μμ, σας περιμένουμε σε ένα μεγάλο Πάρτυ για τους μικρούς και μεγαλύτερους φίλους μας στο Toms Flagship Thessaloniki για την Υποστήριξη του έργου του Συλλόγου Γονέων Παιδιών με Νεοπλασματικές Ασθένειες Β.Ελλάδος “Η ΛΑΜΨΗ”. Το Portal #echaritygr και η #TOMSGREECE σας προσκαλούν σε ένα ξεχωριστό δημιουργικό Σάββατο για την υποστήριξη του έργου του Συλλόγου Γονέων Παιδιών με νεοπλασματικές Ασθένειες Β. Ελλάδος, η «Λάμψη».Ένα πλήθος απο εργαστήρια για παιδιά, με τα αγαπημένα LEGO από την Eduk8, επιτραπέζια και μαριονέτες μυθικών ηρώων από την ομάδα My Greek Games, εργαστήρια κατασκευής κοσμημάτων και μπρελόκ από εξαρτήματα υπολογιστών με τη βοήθεια της Relak και μουσική, χορός και εκπλήξεις για τους μικρούς ήρωες της «Λάμψης».",
  },
  {
    title: "Χορηγία στο 2ο Γυμνάσιο Μίκρας",
    content: "",
  },
];
