export const services = {
    small: {
        left: {
            icon: "fas fa-university",
            title: "Εκπαιδευτική Επίσκεψη",
            body:
                "Η συνεδρία μας είναι χωρισμένη σε δύο ενότητες. Η πρώτη έχει ως στόχο να γνωρίσουν τα παιδιά τι είναι η ρομποτική και η δεύτερη είναι η δραστηριότητα!",
        },
        middle: {
            icon: "fas fa-chalkboard-teacher",
            title: "Επιμορφωτικά Σεμηνάρια",
            body:
                "Η Robot set go οργανώνει Επιμόρφωση για την Αξιοποίηση και Εφαρμογή της Ρομποτικής Τεχνολογίας στη Διδακτική Πράξη.",
        },
        right: {
            icon: "fas fa-birthday-cake",
            title: "Εκδηλώσεις",
            body:
                "Βιωματικό και διαδραστικό παιχνίδι, εισαγωγή στη Ρομποτική. Ένα πάρτυ που θα σας μείνει αξέχαστο!",
        },
    },
    large: {
        first: {
            icon: "",
            title: "Εκπαιδευτική Ρομποτική",
            body:
                "Γενικά, η εκπαιδευτική ρομποτική είναι κλάδος της τεχνολογίας που ασχολείται με τη σχεδίαση, την ανάπτυξη και τη μελέτη ρομπότ. Η επιστήμη της Ρομποτικής αποτελεί συνδυασμό πολλών άλλων επιστημών, κυρίως δε της πληροφορικής, της ηλεκτρονικής και της μηχανολογίας. Η λέξη ρομπότ (Robot) προέρχεται από το Σλαβικό robota που σημαίνει εργασία. Τα ρομπότ είναι αυτόματες μηχανές με προγραμματισμένη συμπεριφορά. H χρήση των ρομπότ αποσκοπεί στην αντικατάσταση του ανθρώπου στην εκτέλεση του εκάστοτε έργου, τόσο σε φυσικό επίπεδο όσο και σε επίπεδο λήψης αποφάσεων.",
            description:
                "Πεποίθηση μας είναι πως το παιχνίδι είναι ένα μέσο το οποίο επιδρά θετικά στην ολοκληρωμένη εξέλιξη των παιδιών. Είναι γνωστό ότι μέσα από αυτό τα παιδιά αποκτούν κοινωνικές δεξιότητες, όπως η επιτυχής επίλυση καθημερινών προβλημάτων, δεξιότητες επικοινωνίας με συνομήλικους, ικανότητα αυτορρύθμισης της συμπεριφοράς τους καθώς και έλεγχο των συναισθημάτων τους.",
            image: "",
            image_text:
                "Ως γνωστόν η Ρομποτική αποτελεί ένα πολύ σημαντικό κομμάτι της Παγκόσμιας Εκπαιδευτικής δραστηριότητας. Τα παιδιά όταν σχεδιάζουν,  κατασκευάζουν και προγραμματίζουν ρομπότ έχουν την ευκαιρία να μάθουν παίζοντας και να αναπτύξουν δεξιότητες σε τομείς όπως τα μαθηματικά , η φυσική , η τεχνολογία , η τέχνη, το περιβάλλον, η κοινωνία κ.ά.",
        },
        second: {
            icon: "",
            title: "",
            body: "",
            image: "",
            image_text: "",
        },
    },
};