export const visit_dim = [
    {
        title: "Παιδιά Δημοτικού",
        icon: "user",
    },
    {
        title: "2,5 ώρες",
        icon: "clock",
    },
    {
        title: "50 με 60 άτομα (τα παιδιά χωρίζονται σε δύο ομάδες από 25 με 30 ατόμων  σε κάθε αίθουσα η ομάδα αποτελείται από 2 έως 3 παιδιά).",
        icon: "users",
    },
];

export const visit_nip = [
    {
        title: "Παιδιά Νηπιαγωγείου",
        icon: "user",
    },
    {
        title: "1 ώρα",
        icon: "clock",
    },
    {
        title: "έως 40 άτομα (τα παιδιά χωρίζονται σε δύο ομάδες από 20 άτομα σε κάθε αίθουσα).",
        icon: "users",
    },
];

export const visit_gym = [
    {
        title: "Παιδιά Δημοτικού",
        icon: "user",
    },
    {
        title: "2,5 ώρες",
        icon: "clock",
    },
    {
        title: "50 με 60 άτομα (τα παιδιά χωρίζονται σε δύο ομάδες από 25 με 30 ατόμων  σε κάθε αίθουσα η ομάδα αποτελείται από 2 έως 3 παιδιά).",
        icon: "users",
    },
];

export const visit_lyc = [
    {
        title: "Παιδιά Δημοτικού",
        icon: "user",
    },
    {
        title: "2,5 ώρες",
        icon: "clock",
    },
    {
        title: "50 με 60 άτομα (τα παιδιά χωρίζονται σε δύο ομάδες από 25 με 30 ατόμων  σε κάθε αίθουσα η ομάδα αποτελείται από 2 έως 3 παιδιά).",
        icon: "users",
    },
];