import React from "react";
import Layout from "../components/Layout";
import Hero from "../components/Hero";
import ClassesTable from "../components/SubComponents/ClassesTable";
import { info3D as info } from "../data/class_info";

export default function threeD() {
  return (
    <Layout title="Τρισδιάστατη Σχεδίαση (3D)">
      <Hero
        title="Τρισδιάστατη Σχεδίαση (3D)"
        subtitle="Η ROBOTSETGO παρουσιάζει την τρισδιάστατη απεικόνιση αντικειμένων και χώρων μέσω σχεδιασμού από ειδικά προγράμματα που δίνει την δυνατότητα στα παιδιά και σε άτομα όλων των ηλικιών να αντιληφθούν μεγάλες έννοιες της καθημερινότητας με έναν ευχάριστο και διασκεδαστικό τρόπο, αλλά παράλληλα παραγωγικό και οργανωτικό."
        bgImage={require("../assets/img/3d.jpg")}
      />
      <section className="pb-10 bg-white">
        <div className="container mx-auto px-6">
          <div className="flex flex-wrap items-center mt-32">
            <div className="w-full md:w-10/12 px-6 mr-auto ml-auto">
              <div className="text-lg font-light leading-relaxed mt-4 mb-4 text-gray-700">
                <div className="pb-4">
                  Συγκεκριμένα μαθαίνουν να αντιλαμβάνονται τις 3 διαστάσεις του
                  χώρου και πως να σκέφτονται σύνθετα, ώστε να σχεδιάζουν και να
                  αποτυπώνουν τις ιδέες τους μέσω των απλών προγραμμάτων μας και
                  έπειτα πολύ απλά να εκτυπώνονται μέσω των τρισδιάστατων
                  εκτυπωτών ώστε να μπορούν πλέον να απολαμβάνουν τα δικά τους
                  παιχνίδια σε πραγματικό χρόνο. Τα παιδιά μπορούν με γνώμονα
                  βασικά εργαλεία όπως τα πολύγωνα να σχεδιάσουν γρήγορα
                  αυτοκίνητα, όμορφα σπιτάκια, χαρακτήρες και έπειτα να τα
                  βάφουν μέσω διαφόρων παλετών χρωμάτων. Έτσι το κάθε
                  αντικείμενο είναι μοναδικό και αντικατοπτρίζει τον χαρακτήρα
                  του κάθε παιδιού.
                </div>
                <div className="pb-4">
                  Ο τρισδιάστατος σχεδιασμός μέσω των έμπειρων δασκάλων μας έχει
                  ως απώτερο σκοπό να βοηθήσει τα παιδιά να εξωτερικεύσουν την
                  φαντασία τους και να συνδυάσει το νοητό με το πραγματικό μέσω
                  της τρισδιάστατης εκτύπωσης. Εκεί τα αποτελέσματα στην
                  συμπεριφορά των παιδιών είναι πραγματικά απίστευτα, χαρίζοντας
                  τους μια όμορφη εμπειρία γεμάτη από γνώσεις τεχνολογικά
                  προηγμένες και χρήσιμες για κάθε τους βήμα.
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>

      <ClassesTable info={info} />
    </Layout>
  );
}
