import React from "react";
import Layout from "../components/Layout";
import Hero from "../components/Hero";

export default function company() {
  return (
    <Layout title="Robot Set Go">
      <Hero
        title="Σχετικά με την εταιρία"
        subtitle="Η Robot set go είναι μια αναπτυσσόμενη αστική μη κερδοσκοπική εταιρία που ιδρύθηκε το 2016 και στοχεύει  στην  εκμάθηση υψηλής τεχνολογίας σε όλες τις ηλικιακές ομάδες. Σε αυτήν την προσπάθεια υπάρχουν συνεργασίες με τα Πανεπιστημιακά Ιδρύματα   καθώς επίσης με ιδιωτικά ιδρύματα  & άλλες αστικές μη κερδοσκοπικές εταιρίες ."
        bgImage={require("../assets/img/company/1.jpg")}
        minHeight="60vh"
      />
      <section className="pb-40 bg-white">
        <div className="container mx-auto px-4">
          <div className="flex flex-wrap items-center mt-12">
            <div className="w-full md:w-10/12 px-4 mr-auto ml-auto">
              <h3 className="text-3xl mb-2 font-semibold leading-normal text-center">
                Αστικός Μη κερδοσκοπικός Οργανισμός Robot Set Go
              </h3>
              <p className="text-lg font-light leading-relaxed mt-4 mb-4 text-gray-700">
                <div className="pb-4">
                  Τα μαθήματα ρομποτικής γίνονται με την μέθοδο του σεναρίου
                  έτσι ώστε τα παιδιά μέσα από τους ρόλους που παίρνουν κάθε
                  φορά μπορούν και αντιμετωπίζουν τις προκλήσεις του σεναρίου.
                  Μέσα από αυτή την μέθοδο τα παιδιά παίζοντας μαθαίνουν την
                  λογική του προγραμματισμού και της ρομποτικής κατασκευής έτσι
                  ώστε να γίνεται πιο εύκολη η κατανόηση μιας δύσκολης
                  επιστήμης. Η εκπαιδευτική πλατφόρμα που χρησιμοποιούμε είναι
                  για παιδιά από 5 ετών μέχρι 14 ετών της Lego BeeBoot – WeDo2 –
                  EV3 .
                </div>
                <div className="pb-4">
                  Για ηλικίες από 14 ετών και πάνω έχουμε τον έξυπνο κόσμο του
                  αυτοματισμού και των κυκλωμάτων χρησιμοποιώντας τις πιο
                  γνωστές πλακέτες (Arduino και RaspberryPi). Μέσω της
                  πλατφόρμας των Arduino, RaspberryPi και άλλων
                  μικρο-επεξεργαστών, ο ενδιαφερόμενος έρχεται σε επαφή με
                  προγραμματισμό υλικού χαμηλότερου επιπέδου (όπως μοτέρ
                  ακριβείας ή αισθητήρες τρισδιάστατης κίνησης και επιτάχυνσης),
                  ο οποίος τους δίνει τη δυνατότητα υλοποίησης πρωτότυπων
                  κατασκευών που ξεφεύγουν από την τυποποιημένη ρομποτική.
                </div>
                <div className="pb-4">
                  Η εισαγωγή στους ηλεκτρονικούς υπολογιστές ξεκινάει από τον
                  απλό χειρισμό τους μέχρι και τον προγραμματισμό ιστοσελίδων
                  και προγραμμάτων. Η σειρά μαθημάτων απευθύνεται από πολύ
                  αρχάριους μέχρι και πολύ προχωρημένους και σε όλες τις
                  ηλικιακές ομάδες. Στόχος των μαθημάτων είναι ο σωστός
                  χειρισμός των ηλεκτρονικών υπολογιστών καθώς και η εισαγωγή
                  στον κόσμο του προγραμματισμού.
                </div>
                <div className="pb-4">
                  Σκοπός των μαθημάτων μας είναι να προσφέρουμε στον
                  ενδιαφερόμενο τις βασικές έννοιες και αρχές του
                  προγραμματισμού κινητών τηλεφώνων και να μάθουν όλες τις νέες
                  τεχνικές για τον καλύτερο και πιο σωστό προγραμματισμό τους.
                </div>
                <div className="pb-4">
                  Στην συνέχεια έχουμε την τρισδιάστατη απεικόνιση αντικειμένων
                  και χώρων μέσω σχεδιασμού από ειδικά προγράμματα που δίνει την
                  δυνατότητα στα παιδιά και σε άτομα όλων των ηλικιών να
                  αντιληφθούν μεγάλες έννοιες της καθημερινότητας με έναν
                  ευχάριστο και διασκεδαστικό τρόπο, αλλά παράλληλα παραγωγικό
                  και οργανωτικό.
                </div>
                <div className="pb-4">
                  Η εταιρία ασχολείται με τον σχεδιασμό βιωματικού διαδραστικού
                  παιχνιδιού που έχει στόχο να προσφέρει μια εμπειρία μάθησης
                  και παιχνιδιού, να προκαλέσει τη δημιουργική σκέψη των παικτών
                  καθώς και τις δεξιότητες επίλυσης προβλημάτων. Σκοπός του
                  παιχνιδιού είναι η σχεδίαση διαδραστικού θέματος ρομποτικής το
                  οποίο θα απευθύνεται σε όλες τις ηλικιακές ομάδες και θα τους
                  γνωρίσει μια πτυχή της ρομποτικής τεχνολογίας μέσω του
                  παιχνιδιού.
                </div>
                <div className="pb-4">
                  Τα μαθήματα γίνονται από έμπειρο προσωπικό που είναι
                  πιστοποιημένα από την Lego με τίτλους CERTIFICATION LEGO
                  MINDSTORMS EDUCATION EV3 και CERTIFICATION LEGO WEDO 2.0.
                  Επίσης όλο το προσωπικό είναι πτυχιούχοι πανεπιστημίων με
                  μεταπτυχιακές σπουδές και εξειδίκευση στον τομέα διδασκαλίας
                  τους.
                </div>
                <div className="pb-4">
                  Τέλος ασχολείται και με το κομμάτι της έρευνας, του σχεδιασμού
                  καινοτόμων εφαρμογών και παρουσίαση όλων αυτών σε σχολεία.
                  Αυτό γίνεται με επίσκεψη στον χώρο μας, που είναι ιδιαίτερα
                  προσεγμένος και τροποποιημένος για τις ανάγκες διδασκαλίας
                  υψηλής τεχνολογίας, ως εκπαιδευτική εκδρομή. Οι εγκαταστάσεις
                  της Robot set go βρίσκονται στον Τρίλοφο Θεσσαλονίκης έχει δύο
                  μεγάλες αίθουσες διδασκαλίας χώρο αναμονής και αμφιθέατρο
                  χωρητικότητας 60 ατόμων.
                </div>
              </p>
              <a
                href="/company_images"
                className="font-bold text-gray-800 mt-8"
              >
                Πατήστε εδώ για να δείτε φωτογραφίες της σχολής
              </a>

              <a
                href="/synergasies"
                className="block font-bold text-gray-800 mt-8"
              >
                Συνεργασίες
              </a>

              <a
                href="/company_images"
                className="block font-bold text-gray-800 mt-8"
              >
                ΕΣΠΑ
              </a>
            </div>
          </div>
        </div>
      </section>
    </Layout>
  );
}
