import React from "react";
import Layout from "../components/Layout";
import Hero from "../components/Hero";

export default function Seminars() {
  return (
    <Layout title="Επιμόρφωση">
      <Hero
        title="Επιμόρφωση"
        subtitle="Η Robot set go οργανώνει  Επιμόρφωση για την Αξιοποίηση και Εφαρμογή της Ρομποτικής Τεχνολογίας στη Διδακτική Πράξη. Έτσι η Εκπαιδευτική Ρομποτική μπαίνει στην ζωή μας δίνοντας τους σύγχρονους τρόπους διδασκαλίας και την δομή των μαθημάτων."
        bgImage={require("../assets/img/seminar.jpg")}
        minHeight="60vh"
      />
      <section className="pb-10 bg-white">
        <div className="container mx-auto px-6">
          <div className="flex flex-wrap items-center mt-32">
            <div className="w-full md:w-10/12 px-6 mr-auto ml-auto">
              <div className="text-lg font-light leading-relaxed mt-4 mb-4 text-gray-700">
                <div className="pb-4">
                  Η Επιμόρφωση στην ρομποτική γίνεται με την μέθοδο του σεναρίου
                  έτσι ώστε οι εκπαιδευόμενοι μέσα από τους ρόλους που παίρνουν
                  κάθε φορά μπορούν και αντιμετωπίζουν τις προκλήσεις του
                  σεναρίου. Μέσα από αυτή την μέθοδο μαθαίνουν την λογική του
                  προγραμματισμού και της ρομποτικής κατασκευής έτσι ώστε να
                  γίνεται πιο εύκολη η κατανόηση μιας δύσκολης επιστήμης. Η
                  εκπαιδευτική πλατφόρμα που χρησιμοποιούμε είναι{" "}
                  <strong>WeDo2 – EV3</strong>.
                </div>
                <div className="pb-4">
                  Απευθύνεται σε εκπαιδευτικούς Α/Βαθμιας και Β/Βαθμιας
                  εκπαίδευσης σχολείων ,φροντιστήρια ξένων γλωσσών, εργαστηρίων
                  ρομποτικής, ΚΔΑΠ αλλά και σε απλούς χρήστες που θέλουν να
                  γνωρίσουν και να ενημερωθούν για τη μεθοδολογία των
                  εκπαιδευτικών πακέτων.
                </div>
                <span className="font-semibold">Περιλαμβάνει:</span>
                <ul className="list-inside list-disc ml-6">
                  <li>Γνωριμία των εκπαιδευτικών υλικών — πακέτων.</li>
                  <li>
                    Εφαρμογή δραστηριοτήτων για εύκολη ένταξη του πακέτου στην
                    τάξη.
                  </li>
                  <li>Πλάνο σεναρίου από τους ίδιους τους εκπαιδευτικούς.</li>
                  <li>Εκτίμηση/Αξιοποίηση Κατασκευής.</li>
                  <li>Δίνετε πιστοποιητικό παρακολούθησης επιμόρφωσης.</li>
                  <li>2 ολοκληρωμένα σενάρια ρομποτικής με οδηγίες.</li>
                </ul>
                <div className="my-6 italic border-grey-200 border-l-8">
                  <div className="mt-4 ml-4">
                    Yπάρχει σε ειδική τιμή το ολοκληρωμένο μας πακέτο 15
                    σεναρίων ρομποτικής το οποίο καλύπτει όλο το σχολικό έτος.
                  </div>
                  <div className="mt-4 ml-4">
                    Τέλος η Επιμόρφωση γίνεται από έμπειρο προσωπικό που είναι
                    πιστοποιημένα από την Lego με τίτλους CERTIFICATION LEGO
                    MINDSTORMS EDUCATION EV3 και CERTIFICATION LEGO WEDO 2.0.
                    Επίσης όλο το προσωπικό είναι πτυχιούχοι πανεπιστημίων με
                    μεταπτυχιακές σπουδές και εξειδίκευση στον τομέα διδασκαλίας
                    τους.
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
    </Layout>
  );
}
