import React from "react";
import Layout from "../components/Layout";
import Hero from "../components/Hero";
import IconsTable from "components/SubComponents/IconsTable";

const info = [
  {
    title: "2392400370 - 6944140426",
    icon: "phone",
  },
];

export default function Syllogoi_Message() {
  return (
    <Layout title="Προς Σύλλογο Γονέων και Κηδεμόνων">
      <Hero
        title="Προς Σύλλογο Γονέων και Κηδεμόνωνς"
        subtitle=""
        bgImage={require("../assets/img/teachers_message.jpg")}
        minHeight="60vh"
      />
      <section className="pb-10 bg-white">
        <div className="container mx-auto px-6">
          <div className="flex flex-wrap items-center my-12">
            <div className="w-full md:w-10/12 px-6 mr-auto ml-auto">
              <div className="text-lg font-light leading-relaxed mt-4 mb-4 text-gray-700">
                <h1 className="text-center font-semibold text-xl">
                  Αγαπητοί Γονείς
                </h1>
                <div className="mt-6">
                  <p className="mb-4">
                    Τα παιδιά παίζοντας, μαθαίνουν να κατασκευάζουν απλές
                    μηχανές, κατανοώντας έτσι βασικές αρχές λειτουργίας τους. Οι
                    μαθητές κατ’ αυτόν τον τρόπο έρχονται σε πρώτη επαφή με τους
                    νόμους της φυσικής. Ο στόχος του εκπαιδευτικού προγράμματος
                    είναι, μέσω της μεταξύ τους συνεργασίας , συναρμολογώντας
                    τροχαλίες, γρανάζια, άξονες κ.τ.λ. , να δώσουν λύση σε ένα
                    πρόβλημα. Έτσι τα παιδιά κατανοούν όλα τα φυσικά μεγέθη της
                    μηχανικής με διασκεδαστικό τρόπο.
                  </p>
                  <p className="mb-4">
                    Το πρόγραμμα εκπαιδευτικής ρομποτικής LEGO WeDo2 αφορά
                    παιδιά ηλικίας Δημοτικού και ήρθε να αναβαθμίσει τον τρόπο
                    που διδάσκεται η ρομποτική στα παιδιά. Προσφέροντας
                    ολοκαίνουργιο εκπαιδευτικό υλικό, δίνει ερεθίσματα στα
                    παιδιά να ανακαλύψουν τους νόμους της μηχανικής,παρατηρώντας
                    τους μηχανισμούς που κατασκευάζουν οι ίδιοι βήμα-βήμα. Το
                    πακέτο με το λογισμικό και η Εισαγωγική Δραστηριότητα είναι
                    σχεδιασμένα για τις τάξεις του Δημοτικού, παρέχοντας μια
                    εκπαιδευτική λύση που θα εξάψει την περιέργεια των μαθητών
                    και θα βελτιώσει τις ικανότητες τους στα πεδία των φυσικών
                    επιστημών , της μηχανικής , της τεχνολογίας και του
                    προγραμματισμού. Τα παιδιά κατασκευάζουν με δομικά στοιχεία
                    (τουβλάκια) μηχανικές κατασκευές που μπορούν να αποτελέσουν
                    τους ήρωες της δικής τους φανταστικής περιπέτειας και να
                    συνδυάσουν προβλήματα από το φυσικό κόσμο. Η σύνδεση με το
                    tablet είναι ασύρματη,γεγονός που δίνει απεριόριστες
                    δυνατότητες στην κίνηση και τη δομή της κατασκευής.
                  </p>
                  <p className="mb-4">
                    Το πρόγραμμα εκπαιδευτικής ρομποτικής LEGO MindstormsEV3
                    αφορά παιδιά ηλικίας Γυμνασίου μέχρι ενήλικες και αποτελεί
                    μια ολοκληρωμένη λύση εκπαίδευσης STEM βασισμένη στην
                    τεχνολογία της ρομποτικής. Η εκπαιδευτική ρομποτική
                    συνδυάζει τη μάθηση με το παιχνίδι και έτσι μετατρέπει την
                    εκπαίδευση σε μία διασκεδαστική δραστηριότητα.
                  </p>
                  <p className="mb-4">
                    Το κόστος υλοποίησης των παραπάνω προγραμμάτων στον χώρο του
                    σχολείου κατά τις απογευματινές ώρες μετά το πέρας των
                    μαθημάτων είναι 20 ευρώ τον μήνα για μια φορά την εβδομάδα
                    διάρκειας 90 λεπτών .Όλα τα υλικά παρέχονται από εμάς,
                    δηλαδή τα εκπαιδευτικά ρομποτικά κουτιά και tablet που
                    απαιτούνται για την ολοκλήρωση της δραστηριότητας. Επίσης τα
                    τμήματα είναι περίπου των 10 ατόμων και χωρίζονται σε 5
                    ομάδες των 2 ατόμων. Ηλικιακά χωρίζονται σε δύο τμήματα
                    Α/Β/Γ και Δ/Ε/ΣΤ. Στο τέλος του κάθε μαθήματος γίνεται
                    ενημέρωση μέσω e-mail στους γονείς για την πορεία των
                    παιδιών. Με το κλείσιμο της χρονιάς,δίνεται Βεβαίωση
                    ολοκλήρωσης του προγράμματος και πραγματοποιούνται δωρεάν
                    εσωτερικοί αγώνες στην σχολή μας όπου δίνεται βεβαίωση
                    συμμετοχής στον διαγωνισμό.
                  </p>
                  <p className="mb-4">
                    Τέλος, σας παρουσιάζουμε την υπηρεσία Συμβουλευτικής
                    Ψυχολογίας & Υποστήριξης γονέων και παιδιών στην σχολή μας
                    με στόχο την επίλυση γνωστικών-συμπεριφορικών θεμάτων που
                    απασχολούν τους γονείς και εμποδίζουν την υγιή ανάπτυξη των
                    παιδιών και των εφήβων.Μη διστάσετε να επικοινωνήσετε μαζί
                    μας για περαιτέρω πληροφορίες.
                  </p>
                  <div>
                    <IconsTable info={info} />
                  </div>

                  <div>
                    <span className="block">Με εκτίμηση,</span>
                    <span className="block font-semibold">
                      Σταμάτης Φιρινίδης
                    </span>
                    <span className="block">Υπεύθυνος τμημάτων ρομποτικής</span>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </section>
    </Layout>
  );
}
